{
  "add_bos_token": true,
  "add_eos_token": false,
  "added_tokens_decoder": {
    "151643": {
      "content": "<пЅњendв–Ѓofв–ЃsentenceпЅњ>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151644": {
      "content": "<пЅњUserпЅњ>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151645": {
      "content": "<пЅњAssistantпЅњ>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151646": {
      "content": "<пЅњbeginв–Ѓofв–ЃsentenceпЅњ>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151647": {
      "content": "<|EOT|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151648": {
      "content": "<think>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151649": {
      "content": "</think>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151650": {
      "content": "<|quad_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151651": {
      "content": "<|quad_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151652": {
      "content": "<|vision_start|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151653": {
      "content": "<|vision_end|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151654": {
      "content": "<|vision_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151655": {
      "content": "<|image_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151656": {
      "content": "<|video_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": true
    },
    "151657": {
      "content": "<tool_call>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151658": {
      "content": "</tool_call>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151659": {
      "content": "<|fim_prefix|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151660": {
      "content": "<|fim_middle|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151661": {
      "content": "<|fim_suffix|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151662": {
      "content": "<|fim_pad|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151663": {
      "content": "<|repo_name|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    },
    "151664": {
      "content": "<|file_sep|>",
      "lstrip": false,
      "normalized": false,
      "rstrip": false,
      "single_word": false,
      "special": false
    }
  },
  "bos_token": "<пЅњbeginв–Ѓofв–ЃsentenceпЅњ>",
  "chat_template": "{% if not add_generation_prompt is defined %}{% set add_generation_prompt = false %}{% endif %}{% set ns = namespace(is_first=false, is_tool=false, is_output_first=true, system_prompt='') %}{%- for message in messages %}{%- if message['role'] == 'system' %}{% set ns.system_prompt = message['content'] %}{%- endif %}{%- endfor %}{{bos_token}}{{ns.system_prompt}}{%- for message in messages %}{%- if message['role'] == 'user' %}{%- set ns.is_tool = false -%}{{'<пЅњUserпЅњ>' + message['content']}}{%- endif %}{%- if message['role'] == 'assistant' and message['content'] is none %}{%- set ns.is_tool = false -%}{%- for tool in message['tool_calls']%}{%- if not ns.is_first %}{{'<пЅњAssistantпЅњ><пЅњtoolв–Ѓcallsв–ЃbeginпЅњ><пЅњtoolв–Ѓcallв–ЃbeginпЅњ>' + tool['type'] + '<пЅњtoolв–ЃsepпЅњ>' + tool['function']['name'] + '\\n' + '```json' + '\\n' + tool['function']['arguments'] + '\\n' + '```' + '<пЅњtoolв–Ѓcallв–ЃendпЅњ>'}}{%- set ns.is_first = true -%}{%- else %}{{'\\n' + '<пЅњtoolв–Ѓcallв–ЃbeginпЅњ>' + tool['type'] + '<пЅњtoolв–ЃsepпЅњ>' + tool['function']['name'] + '\\n' + '```json' + '\\n' + tool['function']['arguments'] + '\\n' + '```' + '<пЅњtoolв–Ѓcallв–ЃendпЅњ>'}}{{'<пЅњtoolв–Ѓcallsв–ЃendпЅњ><пЅњendв–Ѓofв–ЃsentenceпЅњ>'}}{%- endif %}{%- endfor %}{%- endif %}{%- if message['role'] == 'assistant' and message['content'] is not none %}{%- if ns.is_tool %}{{'<пЅњtoolв–Ѓoutputsв–ЃendпЅњ>' + message['content'] + '<пЅњendв–Ѓofв–ЃsentenceпЅњ>'}}{%- set ns.is_tool = false -%}{%- else %}{% set content = message['content'] %}{% if '</think>' in content %}{% set content = content.split('</think>')[-1] %}{% endif %}{{'<пЅњAssistantпЅњ>' + content + '<пЅњendв–Ѓofв–ЃsentenceпЅњ>'}}{%- endif %}{%- endif %}{%- if message['role'] == 'tool' %}{%- set ns.is_tool = true -%}{%- if ns.is_output_first %}{{'<пЅњtoolв–Ѓoutputsв–ЃbeginпЅњ><пЅњtoolв–Ѓoutputв–ЃbeginпЅњ>' + message['content'] + '<пЅњtoolв–Ѓoutputв–ЃendпЅњ>'}}{%- set ns.is_output_first = false %}{%- else %}{{'\\n<пЅњtoolв–Ѓoutputв–ЃbeginпЅњ>' + message['content'] + '<пЅњtoolв–Ѓoutputв–ЃendпЅњ>'}}{%- endif %}{%- endif %}{%- endfor -%}{% if ns.is_tool %}{{'<пЅњtoolв–Ѓoutputsв–ЃendпЅњ>'}}{% endif %}{% if add_generation_prompt and not ns.is_tool %}{{'<пЅњAssistantпЅњ><think>\\n'}}{% endif %}",
  "clean_up_tokenization_spaces": false,
  "eos_token": "<пЅњendв–Ѓofв–ЃsentenceпЅњ>",
  "legacy": true,
  "model_max_length": 16384,
  "pad_token": "<пЅњendв–Ѓofв–ЃsentenceпЅњ>",
  "sp_model_kwargs": {},
  "tokenizer_class": "LlamaTokenizer",
  "unk_token": null,
  "use_default_system_prompt": false
}
